Area Load Sketch can't contain open loops.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId OpenAreaLoadLoop { get; }
  Visual Basic
Public Shared ReadOnly Property OpenAreaLoadLoop As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ OpenAreaLoadLoop {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures SketchFailures Class
  Autodesk.Revit.DB Namespace